{
"total_size": 6,
"type_id":2,
"offset": 0,
"products": [
        {
            "id":1,
            "name": "pizza",
            "description":"Pizza is a dish of Italian origin consisting of a usually round, flat base of leavened wheat-based dough topped with tomatoes, cheese, and often various other ingredients, which is then baked at a high temperature, traditionally in a wood-fired oven.",
            "price": 500,
            "star": 5,
            "img": "imge/food1.png",
            "location": "dominos",
            "created_at": "2021",
            "updated_at": "2023",
            "type_id":2
        },
        {
            "id":2,
            "name": "donut",
            "description":"A doughnut or donut is a type of food made from leavened fried dough. It is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.",
            "price": 250,
            "star": 4.8,
            "img": "imge/food2.jpg",
            "location": "sweet house",
            "created_at": "2022",
            "updated_at": "2023",
            "type_id":2
        },
        {
            "id":6,
            "name": "burgur",
            "description":"A hamburger, or simply burger, is a sandwich consisting of fillings—usually a patty of ground meat, typically beef—placed inside a sliced bun or bread roll.",
            "price": 99,
            "star": 4.5,
            "img": "imge/food6.jpg",
            "location": "burgurs land",
            "created_at": "2022",
            "updated_at": "2023",
            "type_id":2
        },
        {
            "id":7,
            "name": "paratha",
            "description":"Paratha is a flatbread native to South Asia, prevalent throughout the modern-day nations of India, Sri Lanka, Pakistan, Nepal, Bangladesh, Maldives, Afghanistan, Myanmar, Malaysia, Singapore, Mauritius, Fiji, Guyana, Suriname, and Trinidad and Tobago where wheat is the traditional staple.",
            "price": 200,
            "star": 4.9,
            "img": "imge/food7.jpg",
            "location": "panjab de parathe",
            "created_at": "2021",
            "updated_at": "2023",
            "type_id":2
        },
        {
            "id":10,
            "name": "biryani",
            "description":"Biryani is a mixed rice dish originating among the Muslims of South Asia. It is made with Indian spices, vegetables, rice, and usually some type of meat, or in some cases without any meat, and sometimes, in addition, eggs and potatoes.",
            "price": 400,
            "star": 5,
            "img": "imge/food10.png",
            "location": "rice of south",
            "created_at": "2023",
            "updated_at": "2023",
            "type_id":2
        }
]
}
